read_verilog -sv -formal -overwrite {workspace}/is_code/01_rtl/gen_mask.v
design -reset-vlog; proc;
write_json {workspace}/netlist/gen_mask.json